{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "### Librairie à installer dans l'environnement conda (si on exécute en local)\n",
    "# qui sera choisi pour exécuter le carnet\n",
    "from SPARQLWrapper import SPARQLWrapper, JSON, TURTLE, XML, RDFXML, POST\n",
    "\n",
    "import pandas as pd\n",
    "\n",
    "import matplotlib.pyplot as plt\n",
    "import numpy as np\n",
    "\n",
    "import sys\n",
    "from importlib import reload\n",
    "import os\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "### Importer un module de fonctions crées ad hoc\n",
    "##  ATTENTION : le fichier 'sparql_functions.py' doit se trouver \n",
    "#   dans un dossier qui se situe dans le chemin ('path') de recherche\n",
    "#   vu par le présent carnet Jupyter afin que\n",
    "#   l'importation fonctionne correctement\n",
    "\n",
    "# Add parent directory to the path\n",
    "sys.path.insert(0, '..')\n",
    "\n",
    "### If you want to add the parent-parent directory,\n",
    "sys.path.insert(0, '../..')\n",
    "\n",
    "\n",
    "import sparql_functions as spqf"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## SPARQL Query qui récupère les données\n",
    "\n",
    "On exécute la requête grâce à une fonction de la librairie locale qui réalise la mise en forme"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "## define SPARQL enpoint\n",
    "endpoint = \"https://ag16gm9pr0meths2.allegrograph.cloud/repositories/astronomers\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [],
   "source": [
    "u = os.environ.get('ALG_WRITE_US')\n",
    "p = os.environ.get('ALG_WRITE_PS')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [],
   "source": [
    "query = \"\"\"\n",
    "### Resources authors and, optionally, editors\n",
    "\n",
    "\n",
    "PREFIX wdt: <http://www.wikidata.org/prop/direct/>\n",
    "PREFIX rdf:\t<http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
    "PREFIX wd: <http://www.wikidata.org/entity/>\n",
    "PREFIX dcterms:\t<http://purl.org/dc/terms/>\n",
    "PREFIX marcrel:\t<http://id.loc.gov/vocabulary/relators/>\n",
    "PREFIX dc11:\t<http://purl.org/dc/elements/1.1/>\n",
    "\n",
    "WITH <https://github.com/Sciences-historiques-numeriques/astronomers/blob/main/graphs/idref.md>\n",
    "INSERT {\n",
    "  ?s marcrel:aut ?author.\n",
    "  ?s marcrel:edt ?editor.\n",
    " }\n",
    "WHERE {  \n",
    "  {\n",
    "    SELECT DISTINCT ?s\n",
    "  WHERE {\n",
    "    {?s marcrel:aut ?idRef}\n",
    "    } \n",
    "    # OFFSET 100\n",
    "    LIMIT 4000\n",
    "  }\n",
    "  SERVICE <https://data.idref.fr/sparql> {\n",
    "         ?s marcrel:aut ?author.   \n",
    "         OPTIONAL {?s marcrel:edt ?editor}\n",
    "  }\n",
    "}\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "b'<?xml version=\"1.1\"?>\\n<!-- Generated by AllegroGraph 8.3.1 -->\\n<sparql xmlns=\"http://www.w3.org/2005/sparql-results#\">\\n  <head/>\\n  <boolean>true</boolean>\\n</sparql>'\n"
     ]
    }
   ],
   "source": [
    "sparql = SPARQLWrapper(endpoint)\n",
    "sparql.setCredentials(u, p)\n",
    "sparql.setMethod(POST)\n",
    "\n",
    "sparql.setQuery(query) \n",
    "\n",
    "results = sparql.query()\n",
    "print(results.response.read())\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "i = 0\n",
    "\n",
    "# number of works\n",
    "while i < 90000: \n",
    "\n",
    "    query = \"\"\"\n",
    "    PREFIX wdt: <http://www.wikidata.org/prop/direct/>\n",
    "    PREFIX rdf:\t<http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "    PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
    "    PREFIX wd: <http://www.wikidata.org/entity/>\n",
    "    PREFIX dcterms:\t<http://purl.org/dc/terms/>\n",
    "    PREFIX marcrel: <http://id.loc.gov/vocabulary/relators/>\n",
    "    PREFIX dc11:\t<http://purl.org/dc/elements/1.1/>\n",
    "\n",
    "    WITH <https://github.com/Sciences-historiques-numeriques/astronomers/blob/main/graphs/idref.md>\n",
    "    INSERT {\n",
    "    ?s marcrel:aut ?author.\n",
    "    ?s marcrel:edt ?editor.\n",
    "    }\n",
    "    WHERE {  \n",
    "    {\n",
    "        SELECT DISTINCT ?s\n",
    "    WHERE {\n",
    "        {?s marcrel:aut ?idRef}\n",
    "        } \n",
    "        OFFSET \"\"\" + str(i) + \"\"\"\n",
    "        LIMIT 4000\n",
    "    }\n",
    "    SERVICE <https://data.idref.fr/sparql> {\n",
    "            ?s marcrel:aut ?author.   \n",
    "            OPTIONAL {?s marcrel:edt ?editor}\n",
    "    }\n",
    "    }\n",
    "    \"\"\"\n",
    "\n",
    "    sparql.setQuery(query) \n",
    "\n",
    "    try:\n",
    "        results = sparql.query()\n",
    "        print(i, results.response.read())\n",
    "    except Exception as e:\n",
    "        print(e)    \n",
    "    i += 4000"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Add dates, types to documents\n",
    "\n",
    "\n",
    "The basic type is document"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "### Add date\n",
    "\n",
    "\n",
    "i = 0\n",
    "\n",
    "# number of works\n",
    "while i < 90000: \n",
    "\n",
    "    query = \"\"\"\n",
    "    PREFIX wdt: <http://www.wikidata.org/prop/direct/>\n",
    "    PREFIX rdf:\t<http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "    PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
    "    PREFIX wd: <http://www.wikidata.org/entity/>\n",
    "    PREFIX dcterms:\t<http://purl.org/dc/terms/>\n",
    "    PREFIX marcrel: <http://id.loc.gov/vocabulary/relators/>\n",
    "    PREFIX dc11:\t<http://purl.org/dc/elements/1.1/>\n",
    "\n",
    "    WITH <https://github.com/Sciences-historiques-numeriques/astronomers/blob/main/graphs/idref.md>\n",
    "    INSERT {\n",
    "    ?s dc11:date ?date.\n",
    "    }\n",
    "    WHERE {  \n",
    "    {\n",
    "        SELECT DISTINCT ?s\n",
    "    WHERE {\n",
    "        {?s marcrel:aut ?idRef}\n",
    "        } \n",
    "        OFFSET \"\"\" + str(i) + \"\"\"\n",
    "        LIMIT 4000\n",
    "    }\n",
    "    SERVICE <https://data.idref.fr/sparql> {\n",
    "            ?s dc11:date ?date.   \n",
    "    }\n",
    "    }\n",
    "    \"\"\"\n",
    "\n",
    "    sparql.setQuery(query) \n",
    "\n",
    "    try:\n",
    "        results = sparql.query()\n",
    "        print(i, results.response.read())\n",
    "    except Exception as e:\n",
    "        print(e)    \n",
    "    i += 4000"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "### Add type\n",
    "\n",
    "\n",
    "i = 0\n",
    "\n",
    "# number of works\n",
    "while i < 90000: \n",
    "\n",
    "    query = \"\"\"\n",
    "    PREFIX wdt: <http://www.wikidata.org/prop/direct/>\n",
    "    PREFIX rdf:\t<http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "    PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
    "    PREFIX wd: <http://www.wikidata.org/entity/>\n",
    "    PREFIX dcterms:\t<http://purl.org/dc/terms/>\n",
    "    PREFIX marcrel: <http://id.loc.gov/vocabulary/relators/>\n",
    "    PREFIX dc11:\t<http://purl.org/dc/elements/1.1/>\n",
    "    PREFIX bibo: <http://purl.org/ontology/bibo/>\n",
    "\n",
    "    WITH <https://github.com/Sciences-historiques-numeriques/astronomers/blob/main/graphs/idref.md>\n",
    "    INSERT {\n",
    "    ?s rdf:type ?type.\n",
    "    }\n",
    "    WHERE {  \n",
    "    {\n",
    "        SELECT DISTINCT ?s\n",
    "    WHERE {\n",
    "        {?s marcrel:aut ?idRef}\n",
    "        } \n",
    "        OFFSET \"\"\" + str(i) + \"\"\"\n",
    "        LIMIT 4000\n",
    "    }\n",
    "    SERVICE <https://data.idref.fr/sparql> {\n",
    "            ?s rdf:type ?type. \n",
    "           \n",
    "    }\n",
    "    }\n",
    "    \"\"\"\n",
    "\n",
    "    sparql.setQuery(query) \n",
    "\n",
    "    try:\n",
    "        results = sparql.query()\n",
    "        print(i, results.response.read())\n",
    "        i += 4000\n",
    "    except Exception as e:\n",
    "        print(e)    \n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "### Add dcterms:subject\n",
    "\n",
    "\n",
    "i = 0\n",
    "\n",
    "# number of works\n",
    "while i < 90000: \n",
    "\n",
    "    query = \"\"\"\n",
    "    PREFIX wdt: <http://www.wikidata.org/prop/direct/>\n",
    "    PREFIX rdf:\t<http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "    PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
    "    PREFIX wd: <http://www.wikidata.org/entity/>\n",
    "    PREFIX dcterms:\t<http://purl.org/dc/terms/>\n",
    "    PREFIX marcrel: <http://id.loc.gov/vocabulary/relators/>\n",
    "    PREFIX dc11:\t<http://purl.org/dc/elements/1.1/>\n",
    "    PREFIX bibo: <http://purl.org/ontology/bibo/>\n",
    "\n",
    "    WITH <https://github.com/Sciences-historiques-numeriques/astronomers/blob/main/graphs/idref.md>\n",
    "    INSERT {\n",
    "    ?s dcterms:subject ?subject.\n",
    "    }\n",
    "    WHERE {  \n",
    "    {\n",
    "        SELECT DISTINCT ?s\n",
    "    WHERE {\n",
    "        {?s marcrel:aut ?idRef}\n",
    "        } \n",
    "        OFFSET \"\"\" + str(i) + \"\"\"\n",
    "        LIMIT 4000\n",
    "    }\n",
    "    SERVICE <https://data.idref.fr/sparql> {\n",
    "            ?s dcterms:subject ?subject. \n",
    "           \n",
    "    }\n",
    "    }\n",
    "    \"\"\"\n",
    "\n",
    "    sparql.setQuery(query) \n",
    "\n",
    "    try:\n",
    "        results = sparql.query()\n",
    "        print(i, results.response.read())\n",
    "        i += 4000\n",
    "    except Exception as e:\n",
    "        print(e)    \n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "### Add dc11:subject\n",
    "# The books do not seem to have this kind of types\n",
    "\n",
    "\n",
    "i = 0\n",
    "\n",
    "# number of works\n",
    "while i < 90000: \n",
    "\n",
    "    query = \"\"\"\n",
    "    PREFIX wdt: <http://www.wikidata.org/prop/direct/>\n",
    "    PREFIX rdf:\t<http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "    PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
    "    PREFIX wd: <http://www.wikidata.org/entity/>\n",
    "    PREFIX dcterms:\t<http://purl.org/dc/terms/>\n",
    "    PREFIX marcrel: <http://id.loc.gov/vocabulary/relators/>\n",
    "    PREFIX dc11:\t<http://purl.org/dc/elements/1.1/>\n",
    "    PREFIX bibo: <http://purl.org/ontology/bibo/>\n",
    "\n",
    "    WITH <https://github.com/Sciences-historiques-numeriques/astronomers/blob/main/graphs/idref.md>\n",
    "    INSERT {\n",
    "    ?s dc11:subject ?subject.\n",
    "    }\n",
    "    WHERE {  \n",
    "    {\n",
    "        SELECT DISTINCT ?s\n",
    "    WHERE {\n",
    "        {?s marcrel:aut ?idRef}\n",
    "        } \n",
    "        OFFSET \"\"\" + str(i) + \"\"\"\n",
    "        LIMIT 4000\n",
    "    }\n",
    "    SERVICE <https://data.idref.fr/sparql> {\n",
    "            ?s dc11:subject ?subject. \n",
    "           \n",
    "    }\n",
    "    }\n",
    "    \"\"\"\n",
    "\n",
    "    sparql.setQuery(query) \n",
    "\n",
    "    try:\n",
    "        results = sparql.query()\n",
    "        print(i, results.response.read())\n",
    "        i += 4000\n",
    "    except Exception as e:\n",
    "        print(e)    \n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "### Add dcterms:bibliographicCitation\n",
    "# The books do not seem to have this kind of types\n",
    "\n",
    "\n",
    "i = 0\n",
    "\n",
    "# number of works\n",
    "while i < 90000: \n",
    "\n",
    "    query = \"\"\"\n",
    "    PREFIX wdt: <http://www.wikidata.org/prop/direct/>\n",
    "    PREFIX rdf:\t<http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "    PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
    "    PREFIX wd: <http://www.wikidata.org/entity/>\n",
    "    PREFIX dcterms:\t<http://purl.org/dc/terms/>\n",
    "    PREFIX marcrel: <http://id.loc.gov/vocabulary/relators/>\n",
    "    PREFIX dc11:\t<http://purl.org/dc/elements/1.1/>\n",
    "    PREFIX bibo: <http://purl.org/ontology/bibo/>\n",
    "\n",
    "    WITH <https://github.com/Sciences-historiques-numeriques/astronomers/blob/main/graphs/idref.md>\n",
    "    INSERT {\n",
    "    ?s dcterms:bibliographicCitation ?refBiblio.\n",
    "    }\n",
    "    WHERE {  \n",
    "    {\n",
    "        SELECT DISTINCT ?s\n",
    "    WHERE {\n",
    "        {?s marcrel:aut ?idRef}\n",
    "        } \n",
    "        OFFSET \"\"\" + str(i) + \"\"\"\n",
    "        LIMIT 4000\n",
    "    }\n",
    "    SERVICE <https://data.idref.fr/sparql> {\n",
    "            ?s dcterms:bibliographicCitation ?refBiblio. \n",
    "           \n",
    "    }\n",
    "    }\n",
    "    \"\"\"\n",
    "\n",
    "    sparql.setQuery(query) \n",
    "\n",
    "    try:\n",
    "        results = sparql.query()\n",
    "        print(i, results.response.read())\n",
    "        i += 4000\n",
    "    except Exception as e:\n",
    "        print(e)    \n",
    "    "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Add information about persons"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "0 b'<?xml version=\"1.1\"?>\\n<!-- Generated by AllegroGraph 8.3.1 -->\\n<sparql xmlns=\"http://www.w3.org/2005/sparql-results#\">\\n  <head/>\\n  <boolean>true</boolean>\\n</sparql>'\n",
      "4000 b'<?xml version=\"1.1\"?>\\n<!-- Generated by AllegroGraph 8.3.1 -->\\n<sparql xmlns=\"http://www.w3.org/2005/sparql-results#\">\\n  <head/>\\n  <boolean>true</boolean>\\n</sparql>'\n",
      "8000 b'<?xml version=\"1.1\"?>\\n<!-- Generated by AllegroGraph 8.3.1 -->\\n<sparql xmlns=\"http://www.w3.org/2005/sparql-results#\">\\n  <head/>\\n  <boolean>true</boolean>\\n</sparql>'\n",
      "12000 b'<?xml version=\"1.1\"?>\\n<!-- Generated by AllegroGraph 8.3.1 -->\\n<sparql xmlns=\"http://www.w3.org/2005/sparql-results#\">\\n  <head/>\\n  <boolean>true</boolean>\\n</sparql>'\n",
      "16000 b'<?xml version=\"1.1\"?>\\n<!-- Generated by AllegroGraph 8.3.1 -->\\n<sparql xmlns=\"http://www.w3.org/2005/sparql-results#\">\\n  <head/>\\n  <boolean>true</boolean>\\n</sparql>'\n",
      "20000 b'<?xml version=\"1.1\"?>\\n<!-- Generated by AllegroGraph 8.3.1 -->\\n<sparql xmlns=\"http://www.w3.org/2005/sparql-results#\">\\n  <head/>\\n  <boolean>true</boolean>\\n</sparql>'\n",
      "24000 b'<?xml version=\"1.1\"?>\\n<!-- Generated by AllegroGraph 8.3.1 -->\\n<sparql xmlns=\"http://www.w3.org/2005/sparql-results#\">\\n  <head/>\\n  <boolean>true</boolean>\\n</sparql>'\n",
      "28000 b'<?xml version=\"1.1\"?>\\n<!-- Generated by AllegroGraph 8.3.1 -->\\n<sparql xmlns=\"http://www.w3.org/2005/sparql-results#\">\\n  <head/>\\n  <boolean>true</boolean>\\n</sparql>'\n"
     ]
    }
   ],
   "source": [
    "### Add names to persons\n",
    "\n",
    "\n",
    "i = 0\n",
    "\n",
    "# number of persons\n",
    "while i < 32000: \n",
    "\n",
    "    query = \"\"\"\n",
    "    PREFIX wdt: <http://www.wikidata.org/prop/direct/>\n",
    "    PREFIX rdf:\t<http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "    PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
    "    PREFIX wd: <http://www.wikidata.org/entity/>\n",
    "    PREFIX dcterms:\t<http://purl.org/dc/terms/>\n",
    "    PREFIX marcrel: <http://id.loc.gov/vocabulary/relators/>\n",
    "    PREFIX dc11:\t<http://purl.org/dc/elements/1.1/>\n",
    "    PREFIX bibo: <http://purl.org/ontology/bibo/>\n",
    "    PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
    "\n",
    "    WITH <https://github.com/Sciences-historiques-numeriques/astronomers/blob/main/graphs/idref.md>\n",
    "    INSERT {\n",
    "    ?s skos:prefLabel ?prefLabel.\n",
    "    }\n",
    "    WHERE {  \n",
    "    {\n",
    "        SELECT DISTINCT ?s\n",
    "    WHERE {\n",
    "        {?s rdf:type foaf:Person}\n",
    "        } \n",
    "        OFFSET \"\"\" + str(i) + \"\"\"\n",
    "        LIMIT 4000\n",
    "    }\n",
    "    SERVICE <https://data.idref.fr/sparql> {\n",
    "            ?s skos:prefLabel ?prefLabel. \n",
    "           \n",
    "    }\n",
    "    }\n",
    "    \"\"\"\n",
    "\n",
    "    sparql.setQuery(query) \n",
    "\n",
    "    try:\n",
    "        results = sparql.query()\n",
    "        print(i, results.response.read())\n",
    "        i += 4000\n",
    "    except Exception as e:\n",
    "        print(e)    \n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "py311_data_analysis",
   "language": "python",
   "name": "py311_data_analysis"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.8"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
